app/controllers/articles_controller.rb

def new
  @articles = Article.all
---
SELECT "articles".* FROM "articles"

def create
@article = Article.new
  @article.title = params[:article][:title]
  @article.body = params[:article][:body]
  @article.save
---
INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "resumer du journal"], ["created_at", Tue, 10 Sep 2013 11:03:30 UTC +00:00], ["title", "journal1"], ["updated_at", Tue, 10 Sep 2013 11:03:30 UTC +00:00]]